![header-notebooks.png]()

Prática da **Aula 06: Coleta de Dados II**, do curso de **Data Science** da **[Awari](https://awari.com.br/)**. Para utilizá-la, vá no menu "Arquivo" e, em seguida, na opção "Salvar uma cópia no Drive". Isto criará uma cópia deste notebook em uma pasta chamada "Colab Notebooks", no seu Google Drive pessoal. Use a cópia para criar novas células de código ou executar as células desta prática. 

---

# **SQL com Python e SQLite**

## **O que é SQL?**

**SQL** significa *Structured Query Language*, ou "Linguagem de Consulta Estruturada". Resumidamente, é uma linguagem de programação para lidar com banco de dados relacionais (baseado em tabelas).

## **O que é SQLite?**

**SQLite** é um banco de dados relacional que, diferentemente de outras ferramentas do tipo, não armazena informações em um servidor. 

Essa independência acontece porque ele consegue colocar os seus arquivos dentro de si próprio.

A documentação de SQLite está disponível em: https://docs.python.org/3/library/sqlite3.html.

## **SQL com SLite na prática**

A partir daqui, vamos importar o SQLite e aprender como usar a linguagem SQL. 

Note que SQL não é usada apenas no banco de dados SQLite, mas em qualquer banco de dados relacional, como MySQL, Postgres, entre outros. 

Aprendê-la, portanto, garante meios de lidar com diversos softwares de bancos de dados.

### **Instalação e importação de pacotes**

O primeiro passo é instalar as bibliotecas **Pandas** e **SQLite** para uso nesta prática:

In [ ]:
# Importando Pandas e SQLite3
import pandas as pd
import sqlite3

O passo a seguir será necessário para etapas adiante nesta nossa prática. Ele instala um recurso para podermos ler arquivos do Microsoft Excel (com a extensão ".xls") no Google Colab.

In [ ]:
# Instalando recurso para ler ".xls" no Google Colab
!pip install --upgrade xlrd

Com isto, podemos começar a praticar.

### **Criando um banco de dados no SQLite3**

O SQLite3 é um sistema de banco de dados. Para usá-lo, precisamos, primeiro, criar um banco de dados dentro dele para uso. Fazemos isso da seguinte forma:

In [ ]:
# Seta conexão com o SQLite
con  = sqlite3.connect('teste.db')

In [ ]:
# Cria um cursor (recurso do SQLite) para executar instruções SQL
cur = con.cursor()

### **Criando tabelas no banco de dados**

Agora, podemos criar tabelas no banco de dados. A sintaxe (forma de escrita) em SQL para isso está descrita a seguir.

**Sintaxe:**

```
CREATE TABLE nome_da_tabela (
    coluna1 tipo_dados,
    coluna2 tipo_dados,
    coluna3 tipo_dados,
   ....
)
```

Os parâmetros ```coluna``` especificam os nomes das colunas da tabela, enquanto os parâmetros ```tipo_dados``` especifica o tipo de dados que a coluna pode conter (por exemplo, ```varchar``` para sequências de caracteres, ```integer``` para números inteiros, ```date``` para datas etc.).

Usamos o método `execute` do cursor para executar instruções.

In [ ]:
# Criando uma tabela
cur.execute(
    'CREATE TABLE teste ( nome varchar, idade integer, cpf integer(11) )'
)

# Confirmando a criação da tabela
con.commit()

In [ ]:
# Criando outra tabela
cur.execute(
    'CREATE TABLE outratabela ( nome varchar, idade integer, cpf integer(11) )'
)

# Confirmando a criação desta outra tabela
con.commit()

#### **Verificando se as tabelas foram criadas**

Podemos verificar se a nova tabela foi criada consultando a tabela incorporada ao SQLite chamada `sqlite_master`, que agora deve conter uma entrada `teste`. 

Utilizaremos o método `fetchall()` para retornar todas as linhas de um resultado de uma consulta dentro de uma lista.

In [ ]:
# Verificando se as tabelas foram criadas
cur.execute("SELECT name FROM sqlite_master").fetchall()

### **CRUD (*Create*, *Read*, *Update*, *Delete*)**

A seguir, vamos ver as quatro operações fundamentais feitas em bancos de dados, apelidada de **CRUD**, iniciais das seguintes ações:

- **C**reate: ato de criar (ou inserir) dados em um banco de dados;
- **R**read: ato de ler (ou "selecionar" ou, ainda, exibir) dados registrados um banco de dados;
- **U**pdate: ato de atualizar (alterar, modificar, substituir etc.) dados registrados um banco de dados;
- **D**elete: ato de excluir dados registrados um banco de dados.

#### **Inserindo dados em uma tabela já criada**

```INSERT INTO``` é a instrução SQL usada para inserir novos registros em uma tabela. É a ação *create* do CRUD.

**Sintaxe:**

```
INSERT INTO nome_da_tabela  (coluna1, coluna2, coluna3, ...)
```

In [ ]:
## Inserindo dados na tabela "testes"
cur.execute("""
          INSERT INTO teste VALUES
            ('Fulano de tal', 35, 12345678910),
            ('Fulana Ana', 40, 12345678911)
          """)

## Confirmando a ação
con.commit()

#### **Selecionando registros de uma tabela**

```SELECT``` é a instrução SQL para selecionar dados de um banco de dados. É a ação *read* do CRUD.

**Sintaxe:**

```
SELECT * FROM nome_da_tabela
SELECT coluna1, coluna1, coluna3, ... FROM nome_da_tabela
```

In [ ]:
# Exibindo todos os registros da tabela teste
cur.execute("SELECT * FROM teste").fetchall()

In [ ]:
# Exibindo apenas os registros "nome" e "idade" da tabela teste
cur.execute("SELECT nome, idade FROM teste").fetchall()

#### **Atualizando dados de uma tabela**

```UPDATE``` é a instrução SQL para modificar os registros existentes em uma tabela. É a ação *update* do CRUD.

**Sintaxe:**

```
UPDATE nome_da_tabela
SET coluna_que_deseja_mudar = 'novo_valor'
WHERE coluna_condicional IS NOT NULL 
```

In [ ]:
# Atualizando dados da tabela teste
cur.execute(
''' 
UPDATE teste
SET idade = '36'
WHERE nome = 'Fulano de tal'
'''
).fetchall()

In [ ]:
# Exibindo a atualização realizada 
cur.execute(
''' 
SELECT idade 
FROM teste
WHERE nome = 'Fulano de tal'
'''
).fetchall()

#### **Deletando dados em tabelas**

```DELETE``` é a instrução usada para excluir registros existentes em uma tabela. É a ação *delete* do CRUD.

**Sintaxe:**

```
DELETE from nome_da_tabela
WHERE coluna_desejada = 'valor_condição_para_exclusão'
```

In [ ]:
# Excluindo registros de uma tabela
cur.execute(
''' 
DELETE from teste
WHERE nome = 'Fulana Ana'
'''
).fetchall()

In [ ]:
# Excluindo todos os registros que restaram na tabela
cur.execute(
''' 
SELECT * 
FROM teste
'''
).fetchall()

## **Usando Pandas para realizar consultas**

A partir daqui, vamos usar o Pandas, em conjunto com o SQLite, para realizar operações no banco de dados.

Para isso, primeiro, vamos importar um arquivo ".xls" (formato do Microfost Excel), com o qual alimentaremos um banco de dados.

### **Importando arquivo .xls**

O arquivo que usaremos se chama [Global Store.xls](https://docs.google.com/spreadsheets/d/197zdFw9qpF4tyEBt-hu2NjJBRkbJm4b-/edit?usp=share_link&ouid=116814618168396531193&rtpof=true&sd=true). Clique no link para acessá-lo.

Você pode copiá-lo para seu Google Drive ou fazer download dele para seu computador e depois fazer upload para o Google Drive. 

Lembre-se de salvá-lo ou fazer upload na pasta raiz (pasta inicial) de seu Google Drive ou dentro da pasta "Colab Notebooks", já que facilita o uso no Colab.

**Também no Kaggle**

O arquivo também está disponível no Kaggle, como [Global Superstore](https://www.kaggle.com/datasets/shekpaul/global-superstore), um conjunto de dados disponível para análises estatísticas e visualizações. 

Lá, porém, o arquivo está em formato ".zip" e é necessário descompactá-lo para poder usá-lo.

#### **Montagem do drive**

Para acessarmos arquivos do Google Drive no Colab, é preciso repetir os passos vistos na aula anterior, relativos à montagem do drive. Para isso, executamos:

In [ ]:
# Carrega biblioteca necessária
from google.colab import drive

# Montagem do drive
drive.mount('/content/drive', force_remount=True)

#### **Carregando o arquivo "Global Superstore.xls"**

Vamos, então, carregar o arquivo "Global Superstore.xls" para um DataFrame do Pandas:

In [ ]:
# Carregando a primeira aba da planilha
df_orders = pd.read_excel('/content/drive/MyDrive/Global Superstore.xls', sheet_name = 0) 

# Exibindo as colunas e primeiras linhas do DataFrame
df_orders.head()

In [ ]:
# Carregando a segunda aba da planilha
df_returns = pd.read_excel('/content/drive/MyDrive/Global Superstore.xls', sheet_name=1) 

# Exibindo as colunas e primeiras linhas do DataFrame
df_returns.head()

In [ ]:
# Carregando a terceira aba da planilha
df_people = pd.read_excel('/content/drive/MyDrive/Global Superstore.xls', sheet_name=2) 

# Exibindo as colunas e primeiras linhas do DataFrame
df_people.head()

Abaixo, vamos fazer alguma limpeza e transformação de dados para facilitar o uso deles. 

Na prática, estamos substituindo espaços em branco por underlines (```_```) e hífens por vírgulas, no DataFrames que criamos com os dados da planilha.

In [ ]:
# Limpando e transformando dados para facilitar o uso
df_orders.columns = df_orders.columns.str.replace(' ', '_').str.replace('-','').str.lower()
df_returns.columns = df_returns.columns.str.replace(' ', '_').str.replace('-','').str.lower()
df_people.columns = df_people.columns.str.replace(' ', '_').str.replace('-','').str.lower()

### **Conectando o SQLite e criando tabelas a partir dos DataFrames**

In [ ]:
# Conectando-se ao SQLite
bd = sqlite3.connect('superstore.db')

# Criando tabelas nos bancos de dados a partir dos nossos DataFrames
df_orders.to_sql('orders', bd, index=False, if_exists='replace')
df_returns.to_sql('returns', bd, index=False, if_exists='replace')
df_people.to_sql('people', bd, index=False, if_exists='replace')

In [ ]:
# Criando uma função para facilitar instruções SQL
def executaQuery(query):
  return pd.read_sql(query,bd)

A partir daqui, podemos executar SQL dentro do Pandas, o que torna nosso trabalho muito mais fluido.

### **Comandos básicos SQL**

Estes são os comandos básicos do SQL. Praticaremos cada um na sequência. 

* SELECT
* FROM
* LIMIT
* ALIAS
* WHERE
* AND, OR, NOT
* IN
* LIKE
* BETWEEN
* DISTINCT
* MIN, MAX, COUNT, AVG e SUM
* ORDER BY
* GROUP BY
* JOINS

Detalhe: não é obrigatório escrever os comandos em letras maiúsculas, mas, por convenção da comunidade mundial de SQL, ao longo de décadas, tornou-se padrão usar sempre maísculas. Por isso, manteremos tal convenção.

#### **SELECT e FROM**

- Os principais comandos de consulta SQL são `SELECT` e `FROM`:
    
- `SELECT` seleciona as colunas que queremos trazer
- `FROM` seleciona a tabela que analisaremos

Usar um asterisco (`*`) com ```SELECT```  permite selecionar toda das colunas.

In [ ]:
# Usando SELECT * FROM
executaQuery('SELECT * FROM orders')

#### **LIMIT**

Para facilitar a consulta, podemos aplicar `LIMIT`, que define o número de linhas que a query irá trazer. 

Podemos usar `LIMIT` para mostrar as primeiras `n` linhas:

In [ ]:
# Usando LIMITE com SELECT
executaQuery('SELECT * FROM orders LIMIT 5')

Se não quisermos trazer todas as colunas, podemos trazer as colunas desejadas uma a uma, separadas por vírgulas:

In [ ]:
# Selecionado as colunas "cliente" (customer_name) e "cidade" (city)
consulta = '''
           SELECT customer_name,
                  city
           FROM orders
           LIMIT 5
           '''
executaQuery(consulta)

In [ ]:
# Selecionando todas as categorias
consulta = '''
           SELECT category
           FROM orders
           '''
executaQuery(consulta)

#### **ALIAS**

Aliases SQL são usados ​​para fornecer um nome temporário a uma tabela ou coluna de uma tabela.

São úteis para tornar nomes de colunas mais legíveis e ficam disponiveis uma determinada consulta por meio do comando `AS`.

**Sintaxe:**

```
SELECT coluna1 AS col1,
       coluna2 AS col2
FROM nome_da_tabela
```

In [ ]:
# Selecionado as colunas "cliente" (customer_name) e "cidade" (city) com ALIAS (AS)
consulta = '''
           SELECT customer_name AS name,
                  city
           FROM orders
           LIMIT 5
           '''
executaQuery(consulta)

#### **WHERE**


A cláusula ou comando `WHERE` permite filtar registros. Dentro dela, também temos algumas condições que podemos executar.

##### **Igual `=`**

O símbolo `=` significa "igualdade", ou seja, selecionaremos todos os registros que sejam iguais ao valor informado.

In [ ]:
# Selecionar todas as linhas onde a categoria for igual a "Technology"
consulta = '''
           SELECT *
           FROM orders
           WHERE category = 'Technology'
           LIMIT 5
           '''
executaQuery(consulta)

##### **Diferente `<>`**

O símbolo `<>` significa "diferente", ou seja, selecionaremos todos os registros que sejam diferentes do valor informado.

In [ ]:
# Selecionar todas as linhas onde a categoria for diferente a "Technology"
consulta = '''
           SELECT *
           FROM orders
           WHERE category <> 'Technology'
           LIMIT 5
           '''
executaQuery(consulta)

##### **Maior `>`**

O símbolo `>` significa "maior que", ou seja, selecionaremos todos os registros que sejam maiores do que valor informado.

In [ ]:
# Selecionar todas as linhas onde a quantidade seja maior que 10
consulta = '''
           SELECT quantity
           FROM orders
           WHERE quantity > 10
           LIMIT 5
           '''
executaQuery(consulta)

##### **Maior ou Igual `>=`**

`>=` significa "igual ou maior que", ou seja, selecionaremos todos os registros que sejam iguais ou maiores do que valor informado.

In [ ]:
# Selecionar todas as linhas onde a quantidade seja maior ou igual a 10
consulta = '''
           SELECT quantity
           FROM orders
           WHERE quantity >= 10
           LIMIT 5
           '''
executaQuery(consulta)

##### **Menor `<`**

O símbolo `<` significa "menor que", ou seja, selecionaremos todos os registros que sejam menores do que valor informado.

In [ ]:
# Selecionar todas as linhas onde a quantidade seja menor que 10
consulta = '''
           SELECT quantity
           FROM orders
           WHERE quantity < 10
           LIMIT 10
           '''
executaQuery(consulta)

##### **Menor ou Igual `<=`**

O símbolo `<=` significa "igual ou menor que", ou seja, selecionaremos todos os registros que sejam iguais ou menores do que valor informado.

In [ ]:
# Selecionar todas as linhas onde a quantidade seja menor ou igual a 10
consulta = '''
           SELECT quantity
           FROM orders
           WHERE quantity <= 10
           LIMIT 10
           '''
executaQuery(consulta)

##### **BETWEEN**

`BETWEEN` significa "entre", ou seja, selecionaremos todos os registros que estejam entre os valores informados.

In [ ]:
# Selecionar todas as linhas onde valor de venda esteja entre 3000 e 6000
consulta = '''
           SELECT sales
           FROM orders
           WHERE sales BETWEEN 3000 AND 6000
           LIMIT 5
           '''
executaQuery(consulta)

##### **AND**

`AND` significa "e", ou seja, podemos concatenar duas ou mais condições, onde ambas tem que ser verdadeiras para que o retorno seja positivo.

In [ ]:
# Selecionar todas as linhas onde a categoria for igual a Technology e a cidade for igual a Valinhos
consulta = '''
           SELECT *
           FROM orders
           WHERE category = 'Technology'
           AND city = 'Valinhos'
           '''
executaQuery(consulta)

##### **OR**

`AND` significa "ou", ou seja, podemos concatenar duas ou mais condições, onde basta uma das condições ser verdadeira para que o retorno seja positivo.

In [ ]:
# Selecionar todas as linhas onde a categoria for igual a Technology ou a cidade for igual a Valinhos
consulta = '''
           SELECT *
           FROM orders
           WHERE category = 'Technology'
           OR city = 'Valinhos'
           '''
executaQuery(consulta)

##### **IN**

`IN` significa "em", ou seja, retorna todos os valores que estejam dentro de uma lista de opções informadas atraves de uma lista.

In [ ]:
# Selecionar todas os registros que sejam das cidades de New York City e Berlin
consulta = '''
           SELECT *
           FROM orders
           WHERE city IN ('New York City', 'Berlin')
           LIMIT 5
           '''
executaQuery(consulta)

##### **NOT**

`NOT` significa "negação", ou seja, tem efeito de trazer o inverso de qualquer condição posterior a ele.

In [ ]:
# Selecionar todas as linhas que não sejam das cidades de New York City e Berlin
consulta = '''
           SELECT *
           FROM orders
           WHERE city NOT IN ('New York City', 'Berlin')
           LIMIT 5
           '''
executaQuery(consulta)

##### **LIKE**

`LIKE` é utilizado em conjunto com a cláusula `WHERE` e serve para realizar uma busca mais refinada em um campo de uma tabela.

**Sintaxe:**

```
SELECT coluna1, coluna2, ... colunaN
  FROM nome_da_tabela
WHERE nome_coluna LIKE modelo;
```

Existem dois curingas frequentemente usados ​​em conjunto com o LIKE:

 1. O sinal de porcentagem (```%```) representa zero, um ou vários caracteres;
 2. O sinal de sublinhado (```_```) representa um único caractere.

 Para exemplos do uso de LIKE, veja este [tutorial da W3 Schools](https://www.w3schools.com/sql/sql_like.asp).

In [ ]:
# Selecionando todas as linhas em que o nome começa com a letra "P" ("P" maiúsculo)
consulta = '''
           SELECT customer_name name
           FROM orders
           WHERE customer_name LIKE 'P%'
           LIMIT 5
           '''
executaQuery(consulta)

In [ ]:
# Selecionar todas as linhas em que o nome termina com a letra "a" ("a" minúsculo)
consulta = '''
           SELECT customer_name name
           FROM orders
           WHERE customer_name LIKE '%a'
           LIMIT 5
           '''
executaQuery(consulta)

In [ ]:
# Selecionando todas as linhas em que o nome contenha os caracteres 'oa' em qualquer lugar do termo
consulta = '''
           SELECT customer_name name
           FROM orders
           WHERE customer_name LIKE '%oa%'
           LIMIT 5
           '''
executaQuery(consulta)

In [ ]:
# Selecionando todas as linhas em que o nome tem a segunda letra sendo "r" ("r" minúsculo)
consulta = '''
           SELECT customer_name
           FROM orders
           WHERE customer_name LIKE '_r%'
           LIMIT 5
           '''
executaQuery(consulta)

In [ ]:
# Selecionando todas as linhas em que o nome começa com a letra 'P', tenham 2 caracteres e logo depois a letra 'r'
consulta = '''
           SELECT customer_name name
           FROM orders
           WHERE customer_name LIKE 'P__r%'
           LIMIT 5
           '''
executaQuery(consulta)

In [ ]:
# Selecionar todas as linhas que o nome dos consumidores comecem com a letra 'P' e terminem com a letra 'g'
consulta = '''
           SELECT customer_name name
           FROM orders
           WHERE customer_name LIKE 'P%g'
           LIMIT 5
           '''
executaQuery(consulta)

#### **DISTINCT**

```DISTINCT``` permite analisar os valores únicos de uma coluna.

In [ ]:
# Selecionando todas as categorias únicas
consulta = '''
          SELECT DISTINCT category
           FROM orders
           '''
executaQuery(consulta)

#### **Aggregate Functions**

Funções de agregação são funções SQL que permitem executar uma operação aritmética nos valores de uma coluna para todos os registros de uma tabela.

São compostas por `MAX`, `MIN`, `AVG`, `SUM` e `COUNT`. Cada uma delas executa uma tarefa específica.

##### **MAX**

Retorna o maior valor da coluna selecionada.

In [ ]:
# Retorna o valor máximo de custo de frete
consulta = '''
           SELECT MAX(shipping_cost) AS max_shippingcost
           FROM orders
           '''
executaQuery(consulta)

##### **MIN**

Retorna o menor valor da coluna selecionada.

In [ ]:
# Retorna o valor mínimo de custo de frete
consulta = '''
           SELECT MIN(shipping_cost) AS min_shippingcost
           FROM orders
           '''
executaQuery(consulta)

##### **AVG**

Retorna a média de uma coluna numérica.

In [ ]:
# Retorna o valor médio de custo de frete
consulta = '''
           SELECT AVG(shipping_cost) AS avg_shippingcost
           FROM orders
           '''
executaQuery(consulta)

##### **SUM**

Retorna a soma total de uma coluna numérica.

In [ ]:
# Retorna o valor total de custo de frete
consulta = '''
           SELECT ROUND(SUM(shipping_cost),3) AS total_shippingcost
           FROM orders
           '''
executaQuery(consulta)

##### **COUNT**
Retorna o número de linhas que corresponde a um critério especificado.

In [ ]:
# Retorna o número total de ordens na tabela
consulta = '''
          SELECT COUNT(*) AS total_orders
           FROM orders
           '''
executaQuery(consulta)

In [ ]:
# Retornar o numéros distintos de tipos de frete existentes na tabela
consulta = '''
          SELECT COUNT(DISTINCT ship_mode) AS total_shipmode
           FROM orders
           '''
executaQuery(consulta)

#### **ORDER BY**

`ORDER BY` é usado para classificar resultados de uma consulta em ordem crescente ou decrescente.

Ela classifica os registros em ordem crescente (como A-Z ou de um número menor para um maior) por padrão (`ASC`). 

Para classificar os registros em ordem decrescente (como de Z-A ou de um número maior para um menor), use a palavra `DESC`.

In [ ]:
# Seleciona todas as linhas ordenandas pelo maior número de vendas para o menor
consulta = '''
           SELECT sales
           FROM orders
           ORDER BY sales DESC
           LIMIT 5
           '''
executaQuery(consulta)

#### **GROUP BY**

`GROUP BY` é a instrução que agrupa as linhas que têm os mesmos valores em linhas de resumo.

É frequentemente usada com funções agregadas `COUNT()`, `MAX()`, `MIN()`, `SUM()`e `AVG()` para agrupar resultados de uma consulta por uma ou mais colunas.

In [ ]:
# Retorna o valor total de vendas agrupadas pelo tipo de frete
consulta = '''
          SELECT ship_mode, 
                 ROUND(SUM(sales),2) as total_sales
          FROM orders
          GROUP BY ship_mode

           '''
executaQuery(consulta)

In [ ]:
# Retorna o número total de vendas agrupadas pelo tipo de frete
consulta = '''
          SELECT ship_mode, 
                 COUNT(sales) as total_sales
          FROM orders
          GROUP BY ship_mode

           '''
executaQuery(consulta)

In [ ]:
# Retorna a quantidade de registros por categoria
consulta = '''
          SELECT category, 
                 COUNT(*) as quantidade
          FROM orders
          GROUP BY category

           '''
executaQuery(consulta)

#### **JOIN**

`JOIN` é usado para combinar linhas de duas ou mais tabelas, com base em uma coluna relacionada entre elas.

Há diferentes tipos de JOIN no SQL:

1. `(INNER) JOIN`: Retorna registros que possuem valores correspondentes em ambas as tabelas
2. `LEFT (OUTER) JOIN`: Retorna todos os registros da tabela da esquerda e os registros correspondentes da tabela da direita
3. `RIGHT (OUTER) JOIN`: Retorna todos os registros da tabela da direita e os registros correspondentes da tabela da esquerda
4. `FULL (OUTER) JOIN`: Retorna todos os registros quando há uma correspondência na tabela à esquerda ou à direita.

[Esta imagem](https://i.pinimg.com/736x/50/89/6f/50896fa027cb4fa4829c87c8c2dfc054--sql-join-sql-server.jpg) ajuda a entender melhor como os diferentes tipos de JOINs funcionam. Se você já viu algo sobre Teoria de Conjuntos, isto será familiar.

###### **INNER JOIN**

In [ ]:
consulta = '''
          SELECT *
          FROM orders AS o
          INNER JOIN returns AS r
          ON o.order_id = r.order_id

           '''
executaQuery(consulta)

###### **LEFT JOIN**

In [ ]:
consulta = '''
          SELECT *
          FROM orders AS o
          LEFT JOIN returns AS r
          ON o.order_id = r.order_id

           '''
executaQuery(consulta)

In [ ]:
consulta = '''
          SELECT *
          FROM returns AS r
          LEFT JOIN orders AS o
          ON o.order_id = r.order_id

           '''
executaQuery(consulta)

## **5. Considerações**

Vimos um bocado de conceitos. Procure repassá-los e praticá-los. Com o tempo, você verá que muitas coisas que podem ser feitas diretamente com SQL também podem ser feitas com Pandas (ou vice-e-versa). As ideias são as mesmas; as ferramentas e sintaxe de comandos é que mudam.

Recomendamos que você siga estudando e consultando este [tutorial da W2 Schools](https://www.w3schools.com/sql/default.asp) e este outro, do [SQL Tutorial](https://www.sqltutorial.org/), para ir se familizarizando com SQL e para entender como um comando funciona.

Em startups e empresas mais maduras, talvez você já receba dados prontos e formatados da Engenharia de Dados, por meio de CSV, JSON ou APIs, para uso direto com Pandas. No entanto, talvez nem todos os locais tenham essas facilidades e você terá acesso a ler bancos de dados diretamente. Saber SQL é um diferencial nessas situações.

---

Notebook utilizado para fins educacionais da **Awari**.

**© AWARI. Todos os direitos reservados.**